#region License
/*
Copyright 2022-2024 Dmitrii Evdokimov
Open source software

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
*/
#endregion

using Diev.Portal5.API.Tools;

namespace Diev.Portal5.API.Dictionaries;

/// <summary>
/// GET https://portal5.cbr.ru/back/rapi2/dictionaries/64529d5a-b1d9-453c-96f3-f380ea577314 (level 3 Addresse)
/// GET https://portal5.cbr.ru/back/rapi2/dictionaries/64529d5a-b1d9-453c-96f3-f380ea577314?page=3
/// 200 OK
/// </summary>
public record Level3ItemsPage
(   
    /// <summary>
    /// Example: "[{...}, ...]"
    /// </summary>
    IReadOnlyList<Level3Item> Items,

    /// <summary>
    /// Example: {
    /// "TotalRecords": 124,
    /// "TotalPages": 2,
    /// "CurrentPage": 1,
    /// "PerCurrentPage": 100,
    /// "PerNextPage": 24,
    /// "MaxPerPage": 100
    /// }
    /// </summary>
    Pagination Pages
);

/*
{
    "Items": [
        {
            "Code": "36",
            "Subject": "Волго-Вятское ГУ Банка России",
            "Organization": "Волго-Вятское ГУ Банка России",
            "Addressee": "Административное управление",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "01399905-1fb8-41ad-8053-b0ac00f5e6bd"
        },
        {
            "Code": "53",
            "Subject": "Отделение-НБ по Республике Башкортостан Уральского ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Башкортостан Уральского ГУ Банка России",
            "Addressee": "Руководство",
            "DirSDS": "80_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "334e3021-dab6-473e-8059-b0ac00f5e6bd"
        },
        {
            "Code": "82",
            "Subject": "Управление СЗППиОДФУ в Северо-Западном ФО",
            "Organization": "Управление СЗППиОДФУ в Северо-Западном ФО",
            "Addressee": "Управление СЗППиОДФУ в Северо-Западном ФО",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "a808fe3b-42e4-49f8-8076-b0ac00f5e6bd"
        },
        {
            "Code": "73",
            "Subject": "Отделение-НБ по Республике Саха (Якутия) Дальневосточного ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Саха (Якутия) Дальневосточного ГУ Банка России",
            "Addressee": "798 Руководство О-НБ",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "4eb2a2d4-b137-4000-81fd-b0ac00f5e6bd"
        },
        {
            "Code": "34",
            "Subject": "Отделение-НБ по Карачаево-Черкесской Республике Южного ГУ Банка России",
            "Organization": "Отделение-НБ по Карачаево-Черкесской Республике Южного ГУ Банка России",
            "Addressee": "Административный отдел Отделения-НБ Карачаево-Черкесская Республика",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "ba16b918-127e-466f-8217-b0ac00f5e6bd"
        },
        {
            "Code": "62",
            "Subject": "Отделение-НБ по Республике Бурятия Сибирского ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Бурятия Сибирского ГУ Банка России",
            "Addressee": "81_Руководство",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "2e5d6992-3e4a-4a3e-826f-b0ac00f5e6bd"
        },
        {
            "Code": "05",
            "Subject": "Отделение по Воронежской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Воронежской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "db799e2e-066c-417d-8276-b0ac00f5e6bd"
        },
        {
            "Code": "55",
            "Subject": "Отделение по Алтайскому краю Сибирского ГУ Банка России",
            "Organization": "Отделение по Алтайскому краю Сибирского ГУ Банка России",
            "Addressee": "01_Руководство",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "b7fed6e1-6f3d-4c73-82d0-b0ac00f5e6bd"
        },
        {
            "Code": "11",
            "Subject": "Северо-Западное ГУ Банка России",
            "Organization": "Северо-Западное ГУ Банка России",
            "Addressee": "Административное управление",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "ade841ee-845c-4567-8311-b0ac00f5e6bd"
        },
        {
            "Code": "57",
            "Subject": "Отделение по Иркутской обл. Сибирского ГУ Банка России",
            "Organization": "Отделение по Иркутской обл. Сибирского ГУ Банка России",
            "Addressee": "25_Руководство",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "38141329-b7fd-4cf8-8464-b0ac00f5e6bd"
        },
        {
            "Code": "88",
            "Subject": "Восточный центр допуска финансовых организаций",
            "Organization": "Восточный центр допуска финансовых организаций",
            "Addressee": "Восточный центр допуска финансовых организаций ДДиПДФО",
            "DirSDS": "65_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "cd430250-846a-448b-853c-b0ac00f5e6bd"
        },
        {
            "Code": "016",
            "Subject": "Отделение по Тульской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Тульской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "1812b5b4-3a93-460e-8549-b0ac00f5e6bd"
        },
        {
            "Code": "115",
            "Subject": "Центр защиты прав потребителей в г. Нижний Новгород",
            "Organization": "Центр защиты прав потребителей в г. Нижний Новгород",
            "Addressee": "Центр защиты прав потребителей в г. Нижний Новгород",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "91fd9be2-0564-4022-8681-b0ac00f5e6bd"
        },
        {
            "Code": "97",
            "Subject": "Межрегиональный центр инспектирования Центрального федерального округа",
            "Organization": "Банк России",
            "Addressee": "Межрегиональный центр инспектирования Центрального федерального округа",
            "DirSDS": "48_lk",
            "TypeIE2": "ГИБР",
            "Prefix": "ALL",
            "Id": "e470515e-0b09-47da-86ba-b0ac00f5e6bd"
        },
        {
            "Code": "94",
            "Subject": "Южный и Северо-Кавказский межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Отделение по Ростовской обл. Южного ГУ Банка России",
            "Addressee": "Южный и Северо-Кавказский межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "03_lk",
            "TypeIE2": "ГИБР",
            "Prefix": "ALL",
            "Id": "a055ea6e-89bc-4fab-86d6-b0ac00f5e6bd"
        },
        {
            "Code": "110",
            "Subject": "Отделение-НБ по Республике Коми Северо-Западного ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Коми Северо-Западного ГУ Банка России",
            "Addressee": "(87) Управляющий Отделением-НБ Республика Коми",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "d50c4a6f-f210-4883-8701-b0ac00f5e6bd"
        },
        {
            "Code": "90",
            "Subject": "Отделение-НБ по Удмуртской Республике Волго-Вятского ГУ Банка России",
            "Organization": "Отделение-НБ по Удмуртской Республике Волго-Вятского ГУ Банка России",
            "Addressee": "94_Руководство",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "e18ab535-e2ec-4d92-8735-b0ac00f5e6bd"
        },
        {
            "Code": "89",
            "Subject": "Западный центр допуска финансовых организаций",
            "Organization": "Западный центр допуска финансовых организаций",
            "Addressee": "Западный центр допуска финансовых организаций",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "0ffa0a7c-76b1-421f-8750-b0ac00f5e6bd"
        },
        {
            "Code": "19",
            "Subject": "Отделение-НБ по Республике Карелия Северо-Западного ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Карелия Северо-Западного ГУ Банка России",
            "Addressee": "(86) Руководство",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "1160da44-797b-42af-87af-b0ac00f5e6bd"
        },
        {
            "Code": "52",
            "Subject": "Отделение по Челябинской обл. Уральского ГУ Банка России",
            "Organization": "Отделение по Челябинской обл. Уральского ГУ Банка России",
            "Addressee": "Руководство",
            "DirSDS": "75_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "7390cf67-dd3a-45b8-8869-b0ac00f5e6bd"
        },
        {
            "Code": "109",
            "Subject": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
            "Addressee": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "32572fb8-3a57-44a9-8879-b0ac00f5e6bd"
        },
        {
            "Code": "83",
            "Subject": "Управление СЗППиОДФУ в Южном ФО",
            "Organization": "Управление СЗППиОДФУ в Южном ФО",
            "Addressee": "Управление СЗППиОДФУ в Южном ФО",
            "DirSDS": "03_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "a51d62f1-cba2-4650-88b8-b0ac00f5e6bd"
        },
        {
            "Code": "43",
            "Subject": "Отделение-НБ по Республике Мордовия Волго-Вятского ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Мордовия Волго-Вятского ГУ Банка России",
            "Addressee": "89_Заместитель управляющего",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "a03375b1-e5ea-4cd2-88cb-b0ac00f5e6bd"
        },
        {
            "Code": "70",
            "Subject": "Отделение по Магаданской обл. Дальневосточного ГУ Банка России",
            "Organization": "Отделение по Магаданской обл. Дальневосточного ГУ Банка России",
            "Addressee": "744Руководство Отделение Магадан",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "dd4c0108-8b4a-43dc-893c-b0ac00f5e6bd"
        },
        {
            "Code": "14",
            "Subject": "Отделение по Калининградской обл. Северо-Западного ГУ Банка России",
            "Organization": "Отделение по Калининградской обл. Северо-Западного ГУ Банка России",
            "Addressee": "(227)Руководство (Отделения)",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "7a27060a-cf13-4d12-89d2-b0ac00f5e6bd"
        },
        {
            "Code": "66",
            "Subject": "Дальневосточное ГУ Банка России",
            "Organization": "Дальневосточное ГУ Банка России",
            "Addressee": "(ДГУ)Руководство Дальневосточного ГУ",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "0e21fe98-cc11-46ec-8ade-b0ac00f5e6bd"
        },
        {
            "Code": "54",
            "Subject": "Сибирское ГУ Банка России",
            "Organization": "Сибирское ГУ Банка России",
            "Addressee": "Руководство Сибирского ГУ",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "b96d4079-4b23-493d-8b0b-b0ac00f5e6bd"
        },
        {
            "Code": "37",
            "Subject": "Отделение по Кировской обл. Волго-Вятского ГУ Банка России",
            "Organization": "Отделение по Кировской обл. Волго-Вятского ГУ Банка России",
            "Addressee": "33_РУКОВОДСТВО",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "98b92461-4678-456f-8c37-b0ac00f5e6bd"
        },
        {
            "Code": "125",
            "Subject": "Межрегиональный центр надзора в системе кредитной информации (г. Красноярск)",
            "Organization": "Межрегиональный центр надзора в системе кредитной информации (г. Красноярск)",
            "Addressee": "Межрегиональный центр надзора в системе кредитной информации (г. Красноярск)",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "9dfa0d51-1003-4e2e-8d0c-b0ac00f5e6bd"
        },
        {
            "Code": "40",
            "Subject": "Отделение по Саратовской обл. Волго-Вятского ГУ Банка России",
            "Organization": "Отделение по Саратовской обл. Волго-Вятского ГУ Банка России",
            "Addressee": "Отделение Саратов",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "e01d97d7-3597-4e69-8d1b-b0ac00f5e6bd"
        },
        {
            "Code": "76",
            "Subject": "Западный центр допуска финансовых организаций",
            "Organization": "Западный центр допуска финансовых организаций",
            "Addressee": "Западный центр допуска финансовых организаций",
            "DirSDS": "40_lk",
            "TypeIE2": "ДДПДФО",
            "Prefix": "ALL",
            "Id": "8fc88e71-1edf-4aec-8d33-b0ac00f5e6bd"
        },
        {
            "Code": "123",
            "Subject": "Региональный центр развития Казань",
            "Organization": "Региональный центр развития Казань",
            "Addressee": "Региональный центр развития Казань",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "9b89c340-a2e3-43c7-8dcc-b0ac00f5e6bd"
        },
        {
            "Code": "99",
            "Subject": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
            "Addressee": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "22_lk",
            "TypeIE2": "ГИБР",
            "Prefix": "ALL",
            "Id": "448193b6-9834-42f8-8e1d-b0ac00f5e6bd"
        },
        {
            "Code": "121",
            "Subject": "Департамент страхового рынка",
            "Organization": "Банк России",
            "Addressee": "Департамент страхового рынка",
            "DirSDS": "48_lk",
            "TypeIE2": "ДСР",
            "Prefix": "ALL",
            "Id": "05c6152a-734e-4d14-8e2d-b0ac00f5e6bd"
        },
        {
            "Code": "12",
            "Subject": "Отделение по Архангельской обл. Северо-Западного ГУ Банка России",
            "Organization": "Отделение по Архангельской обл. Северо-Западного ГУ Банка России",
            "Addressee": "(11) Руководство Отделения",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "a2fc2fc7-865e-4251-8e94-b0ac00f5e6bd"
        },
        {
            "Code": "17",
            "Subject": "Отделение по Новгородской обл. Северо-Западного ГУ Банка России",
            "Organization": "Отделение по Новгородской обл. Северо-Западного ГУ Банка России",
            "Addressee": "(49) Административный отдел",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "3d3e7f82-7723-4ad9-8edb-b0ac00f5e6bd"
        },
        {
            "Code": "012",
            "Subject": "Отделение по Орловской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Орловской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "e220da51-6250-44e1-8f39-b0ac00f5e6bd"
        },
        {
            "Code": "33",
            "Subject": "Отделение-НБ по Республике Северная Осетия-Алания Южного ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Северная Осетия-Алания Южного ГУ Банка России",
            "Addressee": "Административный отдел Отделение-НБ Республика Северная Осетия-Алания",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "aa966268-9938-49a1-8f43-b0ac00f5e6bd"
        },
        {
            "Code": "07",
            "Subject": "Отделение по Тверской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Тверской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "dcdfed47-ac0d-416d-8fa4-b0ac00f5e6bd"
        },
        {
            "Code": "50",
            "Subject": "Отделение по Пермскому краю Уральского ГУ Банка России",
            "Organization": "Отделение по Пермскому краю Уральского ГУ Банка России",
            "Addressee": "Административный отдел",
            "DirSDS": "57_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "b7386430-c6b7-4a29-90bc-b0ac00f5e6bd"
        },
        {
            "Code": "92",
            "Subject": "Центр по обработке отчетности (Тверь)",
            "Organization": "Центр по обработке отчетности Тверь",
            "Addressee": "Центр по обработке отчетности (Тверь)",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "12e7446c-d37f-4362-90d9-b0ac00f5e6bd"
        },
        {
            "Code": "08",
            "Subject": "Отделение по Калужской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Калужской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "510821c0-79a3-40c0-91e5-b0ac00f5e6bd"
        },
        {
            "Code": "85",
            "Subject": "Управление СЗППиОДФУ в Уральском ФО",
            "Organization": "Управление СЗППиОДФУ в Уральском ФО",
            "Addressee": "Управление СЗППиОДФУ в Уральском ФО",
            "DirSDS": "65_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "ffcc7e41-65d4-4375-92a8-b0ac00f5e6bd"
        },
        {
            "Code": "100",
            "Subject": "Уральский межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Уральский межрегиональный центр инспектирования ГИ Банка России",
            "Addressee": "Уральский межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "65_lk",
            "TypeIE2": "ГИБР",
            "Prefix": "ALL",
            "Id": "070423a4-c5e8-4f35-92ab-b0ac00f5e6bd"
        },
        {
            "Code": "63",
            "Subject": "Отделение-НБ по Республике Алтай Сибирского ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Алтай Сибирского ГУ Банка России",
            "Addressee": "84_Руководство",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "42837442-56f0-4393-92e5-b0ac00f5e6bd"
        },
        {
            "Code": "35",
            "Subject": "Отделение-НБ по Чеченской Республике Южного ГУ Банка России",
            "Organization": "Отделение-НБ по Чеченской Республике Южного ГУ Банка России",
            "Addressee": "Административный отдел",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "306c4801-bc72-4b67-931e-b0ac00f5e6bd"
        },
        {
            "Code": "47",
            "Subject": "Уральское ГУ Банка России",
            "Organization": "Уральское ГУ Банка России",
            "Addressee": "Руководство Уральского ГУ Банка России",
            "DirSDS": "65_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "a56ec12c-4a81-486a-93b3-b0ac00f5e6bd"
        },
        {
            "Code": "51",
            "Subject": "Отделение по Тюменской обл. Уральского ГУ Банка России",
            "Organization": "Отделение по Тюменской обл. Уральского ГУ Банка России",
            "Addressee": "Руководство Отделения Тюмень",
            "DirSDS": "65_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "0749d26b-3228-4862-93e5-b0ac00f5e6bd"
        },
        {
            "Code": "81",
            "Subject": "Управление поддержки потребителей «В» Единого коммуникационного центра СЗППиОДФУ",
            "Organization": "Управление поддержки потребителей «В» Единого коммуникационного центра СЗППиОДФУ",
            "Addressee": "Управление поддержки потребителей «В» Единого коммуникационного центра СЗППиОДФУ",
            "DirSDS": "45_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "0a979b84-0a8c-4760-9486-b0ac00f5e6bd"
        },
        {
            "Code": "16",
            "Subject": "Отделение по Мурманской обл. Северо-Западного ГУ Банка России",
            "Organization": "Отделение по Мурманской обл. Северо-Западного ГУ Банка России",
            "Addressee": "(47) Климов А.Г. - Управляющий Отделением",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "be463852-807a-448d-95b1-b0ac00f5e6bd"
        },
        {
            "Code": "23",
            "Subject": "Отделение по Астраханской обл. Южного ГУ Банка России",
            "Organization": "Отделение по Астраханской обл. Южного ГУ Банка России",
            "Addressee": "Руководство",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "3b18de4c-7d4a-4ed6-962a-b0ac00f5e6bd"
        },
        {
            "Code": "31",
            "Subject": "Отделение-НБ по Кабардино-Балкарской Республике Южного ГУ Банка России",
            "Organization": "Отделение-НБ по Кабардино-Балкарской Республике Южного ГУ Банка России",
            "Addressee": "383-1_ Управляющий",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "059abb6a-959d-4f0d-97de-b0ac00f5e6bd"
        },
        {
            "Code": "103",
            "Subject": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
            "Organization": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
            "Addressee": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "a96d8bc8-f491-4f91-97ff-b0ac00f5e6bd"
        },
        {
            "Code": "48",
            "Subject": "Отделение по Курганской обл. Уральского ГУ Банка России",
            "Organization": "Отделение по Курганской обл. Уральского ГУ Банка России",
            "Addressee": "537_Руководство",
            "DirSDS": "65_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "82f1c0ac-eb8a-4f1a-98cb-b0ac00f5e6bd"
        },
        {
            "Code": "32",
            "Subject": "Отделение-НБ по Республике Калмыкия Южного ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Калмыкия Южного ГУ Банка России",
            "Addressee": "Административный отдел Отделения-НБ Республика Калмыкия",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "ddef2dd6-39ba-4af2-98e5-b0ac00f5e6bd"
        },
        {
            "Code": "84",
            "Subject": "Управление СЗППиОДФУ в Приволжском ФО",
            "Organization": "Управление СЗППиОДФУ в Приволжском ФО",
            "Addressee": "Управление СЗППиОДФУ в Приволжском ФО",
            "DirSDS": "22_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "e54efc52-c9c8-46e0-99a4-b0ac00f5e6bd"
        },
        {
            "Code": "24",
            "Subject": "Отделение по Волгоградской обл. Южного ГУ Банка России",
            "Organization": "Отделение по Волгоградской обл. Южного ГУ Банка России",
            "Addressee": "Секретариат управляющего отделением",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "d8abc65d-ffac-4690-9a36-b0ac00f5e6bd"
        },
        {
            "Code": "59",
            "Subject": "Отделение по Омской обл. Сибирского ГУ Банка России",
            "Organization": "Отделение по Омской обл. Сибирского ГУ Банка России",
            "Addressee": "52_Руководство",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "83fc9504-c13d-4ac8-9a39-b0ac00f5e6bd"
        },
        {
            "Code": "69",
            "Subject": "Отделение по Камчатскому краю Дальневосточного ГУ Банка России",
            "Organization": "Отделение по Камчатскому краю Дальневосточного ГУ Банка России",
            "Addressee": "(730) Руководство",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "12ae9709-a056-47b3-9a6c-b0ac00f5e6bd"
        },
        {
            "Code": "72",
            "Subject": "Отделение по Чукотскому автономному округу Дальневосточного ГУ Банка России",
            "Organization": "Отделение по Чукотскому автономному округу Дальневосточного ГУ Банка России",
            "Addressee": "(777)Руководство",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "bf543d85-d2dd-49d0-9b7f-b0ac00f5e6bd"
        },
        {
            "Code": "46",
            "Subject": "Отделение-НБ по Чувашской Республике Волго-Вятского ГУ Банка России",
            "Organization": "Отделение-НБ по Чувашской Республике Волго-Вятского ГУ Банка России",
            "Addressee": "97_Управляющий Отделением-НБ Чувашская Республика",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "39d10087-0b37-4da5-9be7-b0ac00f5e6bd"
        },
        {
            "Code": "45",
            "Subject": "Отделение-НБ по Республике Татарстан Волго-Вятского ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Татарстан Волго-Вятского ГУ Банка России",
            "Addressee": "Руководство",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "acbc163a-15b7-4bed-9cae-b0ac00f5e6bd"
        },
        {
            "Code": "60",
            "Subject": "Отделение по Томской обл. Сибирского ГУ Банка России",
            "Organization": "Отделение по Томской обл. Сибирского ГУ Банка России",
            "Addressee": "69_Административный отдел",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "92469b98-d420-4dfd-9d2b-b0ac00f5e6bd"
        },
        {
            "Code": "58",
            "Subject": "Отделение по Кемеровской обл. Сибирского ГУ Банка России",
            "Organization": "Отделение по Кемеровской обл. Сибирского ГУ Банка России",
            "Addressee": "32_Управляющий Отделением Кемерово",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "60cc1bf6-19bb-4ef6-9d68-b0ac00f5e6bd"
        },
        {
            "Code": "22",
            "Subject": "Отделение по Ставропольскому краю Южного ГУ Банка России",
            "Organization": "Отделение по Ставропольскому краю Южного ГУ Банка России",
            "Addressee": "Административный отдел",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "b12321da-e8b1-4e66-9e9e-b0ac00f5e6bd"
        },
        {
            "Code": "49",
            "Subject": "Отделение по Оренбургской обл. Уральского ГУ Банка России",
            "Organization": "Отделение по Оренбургской обл. Уральского ГУ Банка России",
            "Addressee": "553-Руководство Отделения Оренбург",
            "DirSDS": "65_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "a96b0626-524f-4b99-9ee9-b0ac00f5e6bd"
        },
        {
            "Code": "010",
            "Subject": "Отделение по Курской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Курской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "c2367058-00bb-4ca1-a0c8-b0ac00f5e6bd"
        },
        {
            "Code": "06",
            "Subject": "Отделение по Ивановской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Ивановской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "8922cb60-de2c-4ea4-a0d8-b0ac00f5e6bd"
        },
        {
            "Code": "96",
            "Subject": "Межрегиональный центр инспектирования крупнейших участников финансового рынка",
            "Organization": "Банк России",
            "Addressee": "Межрегиональный центр инспектирования крупнейших участников финансового рынка",
            "DirSDS": "48_lk",
            "TypeIE2": "ГИБР",
            "Prefix": "ALL",
            "Id": "3bb567f5-4ac6-4235-a129-b0ac00f5e6bd"
        },
        {
            "Code": "017",
            "Subject": "Отделение по Ярославской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Ярославской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "c62d5f4c-75ec-4fe1-a1b7-b0ac00f5e6bd"
        },
        {
            "Code": "014",
            "Subject": "Отделение по Смоленской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Смоленской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "813cb226-8a7d-4c4a-a1c3-b0ac00f5e6bd"
        },
        {
            "Code": "67",
            "Subject": "Отделение по Хабаровскому краю Дальневосточного ГУ Банка России",
            "Organization": "Отделение по Хабаровскому краю Дальневосточного ГУ Банка России",
            "Addressee": "(708) Руководство",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "aa06be93-22b7-4df0-a1db-b0ac00f5e6bd"
        },
        {
            "Code": "25",
            "Subject": "Отделение-НБ по Республике Ингушетия Южного ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Ингушетия Южного ГУ Банка России",
            "Addressee": "Административный отдел",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "ffd95ac4-d796-4bfc-a274-b0ac00f5e6bd"
        },
        {
            "Code": "116",
            "Subject": "Центр защиты прав потребителей в г. Екатеринбург",
            "Organization": "Центр защиты прав потребителей в г. Екатеринбург",
            "Addressee": "Центр защиты прав потребителей в г. Екатеринбург",
            "DirSDS": "65_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "dce43b28-5920-4cd2-a307-b0ac00f5e6bd"
        },
        {
            "Code": "122",
            "Subject": "Центр финансового мониторинга и валютного контроля (г. Екатеринбург)",
            "Organization": "Центр финансового мониторинга и валютного контроля (г. Екатеринбург)",
            "Addressee": "Центр финансового мониторинга и валютного контроля (г. Екатеринбург)",
            "DirSDS": " 65_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "3acec4d8-cea9-42c6-a332-b0ac00f5e6bd"
        },
        {
            "Code": "78",
            "Subject": "Служба по защите прав потребителей и обеспечению доступности финансовых услуг",
            "Organization": "Банк России",
            "Addressee": "Служба по защите прав потребителей и обеспечению доступности финансовых услуг",
            "DirSDS": "48_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "e700ca00-e019-4568-a390-b0ac00f5e6bd"
        },
        {
            "Code": "124",
            "Subject": "Межрегиональный центр надзора в системе кредитной информации (г. Самара)",
            "Organization": "Межрегиональный центр надзора в системе кредитной информации (г. Самара)",
            "Addressee": "Межрегиональный центр надзора в системе кредитной информации (г. Самара)",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "054b1981-04b5-48af-a428-b0ac00f5e6bd"
        },
        {
            "Code": "68",
            "Subject": "Отделение по Амурской обл. Дальневосточного ГУ Банка России",
            "Organization": "Отделение по Амурской обл. Дальневосточного ГУ Банка России",
            "Addressee": "(710) Руководство",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "ac253e21-2e97-4196-a42a-b0ac00f5e6bd"
        },
        {
            "Code": "01",
            "Subject": "ГУ Банка России по Центральному федеральному округу (Московский регион)",
            "Organization": "ГУ Банка России по ЦФО",
            "Addressee": "Руководство ГУ",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "196b58f5-8429-432b-a5db-b0ac00f5e6bd"
        },
        {
            "Code": "41",
            "Subject": "Отделение по Ульяновской обл. Волго-Вятского ГУ Банка России",
            "Organization": "Отделение по Ульяновской обл. Волго-Вятского ГУ Банка России",
            "Addressee": "73_АДМИНИСТРАТИВНЫЙ ОТДЕЛ",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "602162e9-fd5b-45e1-a5ea-b0ac00f5e6bd"
        },
        {
            "Code": "74",
            "Subject": "Отделение по Еврейской автономной обл. Дальневосточного ГУ Банка России",
            "Organization": "Отделение по Еврейской автономной обл. Дальневосточного ГУ Банка России",
            "Addressee": "(799) Руководство",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "102dbf79-fc8c-4ae4-a634-b0ac00f5e6bd"
        },
        {
            "Code": "21",
            "Subject": "Южное ГУ Банка России",
            "Organization": "Южное ГУ Банка России",
            "Addressee": "Административное управление",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "c5ed57bf-3789-407d-a672-b0ac00f5e6bd"
        },
        {
            "Code": "118",
            "Subject": "Центр защиты прав потребителей в г. Ростов-на-Дону",
            "Organization": "Центр защиты прав потребителей в г. Ростов-на-Дону",
            "Addressee": "Центр защиты прав потребителей в г. Ростов-на-Дону",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "536e7afa-bfff-4d49-a6b4-b0ac00f5e6bd"
        },
        {
            "Code": "111",
            "Subject": "Управление поведенческого надзора в сфере финансовых услуг",
            "Organization": "Банк России",
            "Addressee": "Служба по защите прав потребителей и обеспечению доступности финансовых услуг",
            "DirSDS": "48_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "ab58c4f8-5063-47a9-a745-b0ac00f5e6bd"
        },
        {
            "Code": "13",
            "Subject": "Отделение по Вологодской обл. Северо-Западного ГУ Банка России",
            "Organization": "Отделение по Вологодской обл. Северо-Западного ГУ Банка России",
            "Addressee": "(19) Руководство Отделения Вологда",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "315ca2ce-107b-4c8f-a791-b0ac00f5e6bd"
        },
        {
            "Code": "09",
            "Subject": "Отделение по Костромской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Костромской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "84937bd0-eaaf-4959-a7cd-b0ac00f5e6bd"
        },
        {
            "Code": "101",
            "Subject": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
            "Addressee": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "05_lk",
            "TypeIE2": "ГИБР",
            "Prefix": "ALL",
            "Id": "c1056448-24b4-4de6-a872-b0ac00f5e6bd"
        },
        {
            "Code": "013",
            "Subject": "Отделение по Рязанской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Рязанской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "70d2a920-283d-481d-a9af-b0ac00f5e6bd"
        },
        {
            "Code": "95",
            "Subject": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
            "Organization": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
            "Addressee": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
            "DirSDS": "50_lk",
            "TypeIE2": "ГИБР",
            "Prefix": "ALL",
            "Id": "1b13f01d-859b-4534-aa0d-b0ac00f5e6bd"
        },
        {
            "Code": "42",
            "Subject": "Отделение-НБ по Республике Марий Эл Волго-Вятского ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Марий Эл Волго-Вятского ГУ Банка России",
            "Addressee": "Административный отдел",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "9871b9ba-8024-4aff-aa80-b0ac00f5e6bd"
        },
        {
            "Code": "04",
            "Subject": "Отделение по Владимирской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Владимирской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "17e58114-52b3-4870-aae4-b0ac00f5e6bd"
        },
        {
            "Code": "120",
            "Subject": "РСП (ДСР)–ДЛ",
            "Organization": "Банк России",
            "Addressee": "РСП (ДСР)",
            "DirSDS": "48_lk",
            "TypeIE2": "ДСР",
            "Prefix": "ALL",
            "Id": "50de98bd-815d-4560-aaf1-b0ac00f5e6bd"
        },
        {
            "Code": "114",
            "Subject": "Управление СТБН в г. Нижний Новгород ",
            "Organization": "Волго-Вятское ГУ Банка России",
            "Addressee": "СТБН Отдел банковского надзора №4 УБН №4",
            "DirSDS": "48_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "5115b5fd-1cbd-4fe2-aaf1-b0ac00f5e6bd"
        },
        {
            "Code": "77",
            "Subject": "Восточный центр допуска финансовых организаций",
            "Organization": "Восточный центр допуска финансовых организаций",
            "Addressee": "Восточный центр допуска финансовых организаций ДДиПДФО",
            "DirSDS": "65_lk",
            "TypeIE2": "ДДПДФО",
            "Prefix": "ALL",
            "Id": "afff90cf-11e7-47b7-ac68-b0ac00f5e6bd"
        },
        {
            "Code": "93",
            "Subject": "Главная инспекция Банка России",
            "Organization": "Банк России",
            "Addressee": "Главная инспекция Банка России",
            "DirSDS": "48_lk",
            "TypeIE2": "ГИБР",
            "Prefix": "ALL",
            "Id": "56d806b9-83f8-4732-ad00-b0ac00f5e6bd"
        },
        {
            "Code": "107",
            "Subject": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
            "Addressee": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "dc32a046-4b97-46b6-ad0e-b0ac00f5e6bd"
        },
        {
            "Code": "113",
            "Subject": "Управление методологии поведенческого надзора",
            "Organization": "Банк России",
            "Addressee": "Служба по защите прав потребителей и обеспечению доступности финансовых услуг",
            "DirSDS": "48_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "336a9b3b-a86a-40b8-ae19-b0ac00f5e6bd"
        },
        {
            "Code": "64",
            "Subject": "Отделение-НБ по Республике Тыва Сибирского ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Тыва Сибирского ГУ Банка России",
            "Addressee": "93_Управляющий",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "65191006-1f6b-4b2a-aecb-b0ac00f5e6bd"
        },
        {
            "Code": "102",
            "Subject": "Южный и Северо-Кавказский межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Отделение по Ростовской обл. Южного ГУ Банка России",
            "Addressee": "Южный и Северо-Кавказский межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "0e57a12f-9892-4c37-af17-b0ac00f5e6bd"
        },
        {
            "Code": "02",
            "Subject": "Отделение по Белгородской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Белгородской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "043970e4-3252-4992-af33-b0ac00f5e6bd"
        }
    ],
    "PaginationInfo": {
        "TotalRecords": 124,
        "TotalPages": 2,
        "CurrentPage": 1,
        "PerCurrentPage": 100,
        "PerNextPage": 24,
        "MaxPerPage": 100
    }
}
*/

/* page=2
{
    "Items": [
        {
            "Code": "18",
            "Subject": "Отделение по Псковской обл. Северо-Западного ГУ Банка России",
            "Organization": "Отделение по Псковской обл. Северо-Западного ГУ Банка России",
            "Addressee": "(58) руководство Отделения Псков",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "5fe3da3f-dec2-4760-b015-b0ac00f5e6bd",
            "row_num": 101
        },
        {
            "Code": "65",
            "Subject": "Отделение-НБ по Республике Хакасия Сибирского ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Хакасия Сибирского ГУ Банка России",
            "Addressee": "95_Руководство",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "0814b537-7922-42ec-b0c9-b0ac00f5e6bd",
            "row_num": 102
        },
        {
            "Code": "28",
            "Subject": "Отделение по г. Севастополь Южного ГУ Банка России",
            "Organization": "Отделение по г. Севастополь Южного ГУ Банка России",
            "Addressee": "Административный отдел (Севастополь)",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "ff4ecf63-fb9b-4e78-b12f-b0ac00f5e6bd",
            "row_num": 103
        },
        {
            "Code": "56",
            "Subject": "Отделение по Красноярскому краю Сибирского ГУ Банка России",
            "Organization": "Отделение по Красноярскому краю Сибирского ГУ Банка России",
            "Addressee": "04_Руководство Отделения",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "d01dabef-a50c-4194-b1fa-b0ac00f5e6bd",
            "row_num": 104
        },
        {
            "Code": "87",
            "Subject": "Управление СЗППиОДФУ в Дальневосточном ФО",
            "Organization": "Управление СЗППиОДФУ в Дальневосточном ФО",
            "Addressee": "Управление СЗППиОДФУ в Дальневосточном ФО",
            "DirSDS": "05_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "dc0ccfc2-72b3-4a08-b315-b0ac00f5e6bd",
            "row_num": 105
        },
        {
            "Code": "27",
            "Subject": "Отделение по Ростовской обл. Южного ГУ Банка России",
            "Organization": "Отделение по Ростовской обл. Южного ГУ Банка России",
            "Addressee": "Административный отдел",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "097c2b8f-b3ba-43be-b3f4-b0ac00f5e6bd",
            "row_num": 106
        },
        {
            "Code": "011",
            "Subject": "Отделение по Липецкой обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Липецкой обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "2b4465e1-3be1-40da-b4d6-b0ac00f5e6bd",
            "row_num": 107
        },
        {
            "Code": "112",
            "Subject": "Управление поведенческого надзора в сфере ценных бумаг, коллективных инвестиций и корпоративных отношений",
            "Organization": "Банк России",
            "Addressee": "Служба по защите прав потребителей и обеспечению доступности финансовых услуг",
            "DirSDS": "48_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "0aec69a0-4c60-40cd-b500-b0ac00f5e6bd",
            "row_num": 108
        },
        {
            "Code": "75",
            "Subject": "Департамент допуска и прекращения деятельности финансовых организаций",
            "Organization": "Банк России",
            "Addressee": "Департамент допуска и прекращения деятельности финансовых организаций",
            "DirSDS": "48_lk",
            "TypeIE2": "ДДПДФО",
            "Prefix": "ALL",
            "Id": "74bb3dd7-6ff2-4c7b-b574-b0ac00f5e6bd",
            "row_num": 109
        },
        {
            "Code": "29",
            "Subject": "Отделение-НБ по Республике Адыгея Южного ГУ Банка России",
            "Organization": "Отделение-НБ по Республике Адыгея Южного ГУ Банка России",
            "Addressee": "Административный отдел",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "c0039a96-9ce4-442a-b5e5-b0ac00f5e6bd",
            "row_num": 110
        },
        {
            "Code": "015",
            "Subject": "Отделение по Тамбовской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Тамбовской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "eb9146f4-1577-4c0d-b5ed-b0ac00f5e6bd",
            "row_num": 111
        },
        {
            "Code": "119",
            "Subject": "Управление анализа рисков и внутреннего контроля",
            "Organization": "Банк России",
            "Addressee": "Служба по защите прав потребителей и обеспечению доступности финансовых услуг",
            "DirSDS": "48_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "84ca931c-2a3d-4eff-b65c-b0ac00f5e6bd",
            "row_num": 112
        },
        {
            "Code": "98",
            "Subject": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
            "Addressee": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "40_lk",
            "TypeIE2": "ГИБР",
            "Prefix": "ALL",
            "Id": "228f2def-70f5-4647-b751-b0ac00f5e6bd",
            "row_num": 113
        },
        {
            "Code": "38",
            "Subject": "Отделение по Самарской обл. Волго-Вятского ГУ Банка России",
            "Organization": "Отделение по Самарской обл. Волго-Вятского ГУ Банка России",
            "Addressee": "Руководство Отделения Самара",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "da2d5297-bf3c-44cc-b778-b0ac00f5e6bd",
            "row_num": 114
        },
        {
            "Code": "61",
            "Subject": "Отделение по Забайкальскому краю Сибирского ГУ Банка России",
            "Organization": "Отделение по Забайкальскому краю Сибирского ГУ Банка России",
            "Addressee": "76_Руководство",
            "DirSDS": "50_lk",
            "TypeIE2": "СГУ",
            "Prefix": "ALL",
            "Id": "30ac6cef-2d99-4e3c-b83f-b0ac00f5e6bd",
            "row_num": 115
        },
        {
            "Code": "108",
            "Subject": "Уральский межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Уральский межрегиональный центр инспектирования ГИ Банка России",
            "Addressee": "Уральский межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "65_lk",
            "TypeIE2": "УГУ",
            "Prefix": "ALL",
            "Id": "aa850cf5-a76f-4b28-b906-b0ac00f5e6bd",
            "row_num": 116
        },
        {
            "Code": "80",
            "Subject": "Управление поддержки потребителей «С» Единого коммуникационного центра СЗППиОДФУ",
            "Organization": "Управление поддержки потребителей «С» Единого коммуникационного центра СЗППиОДФУ",
            "Addressee": "Управление поддержки потребителей «С» Единого коммуникационного центра СЗППиОДФУ",
            "DirSDS": "22_lk",
            "TypeIE2": "СЗППОДФУ",
            "Prefix": "ALL",
            "Id": "732e94fc-6a26-46a8-b99e-b0ac00f5e6bd",
            "row_num": 117
        },
        {
            "Code": "71",
            "Subject": "Отделение по Сахалинской обл. Дальневосточного ГУ Банка России",
            "Organization": "Отделение по Сахалинской обл. Дальневосточного ГУ Банка России",
            "Addressee": "(764)Руководство",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "d6c66d1d-3273-49df-b9ae-b0ac00f5e6bd",
            "row_num": 118
        },
        {
            "Code": "26",
            "Subject": "Отделение по Республике Крым Южного ГУ Банка России",
            "Organization": "Отделение по Республике Крым Южного ГУ Банка России",
            "Addressee": "Административный отдел",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "93cc4541-8880-4cd3-bab3-b0ac00f5e6bd",
            "row_num": 119
        },
        {
            "Code": "30",
            "Subject": "Отделение - Национальный банк по Республике Дагестан Южного главного управления Центрального банка Российской Федерации",
            "Organization": "Отделение - Национальный банк по Республике Дагестан Южного главного управления Центрального банка Российской Федерации",
            "Addressee": "Административный отдел",
            "DirSDS": "03_lk",
            "TypeIE2": "ЮГУ",
            "Prefix": "ALL",
            "Id": "a6cd8407-8a91-42e0-bd55-b0ac00f5e6bd",
            "row_num": 120
        },
        {
            "Code": "03",
            "Subject": "Отделение по Брянской обл. ГУ Банка России по ЦФО",
            "Organization": "Отделение по Брянской обл. ГУ Банка России по ЦФО",
            "Addressee": "Руководство",
            "DirSDS": "45_lk",
            "TypeIE2": "ЦФО",
            "Prefix": "ALL",
            "Id": "e1af2ed9-d94b-4d16-bd92-b0ac00f5e6bd",
            "row_num": 121
        },
        {
            "Code": "117",
            "Subject": "Центр финансового мониторинга и валютного контроля (г. Владивосток)",
            "Organization": "Центр финансового мониторинга и валютного контроля (г. Владивосток)",
            "Addressee": "Центр финансового мониторинга и валютного контроля (г. Владивосток)",
            "DirSDS": "05_lk",
            "TypeIE2": "ДГУ",
            "Prefix": "ALL",
            "Id": "53d57d4c-6b89-41c5-bdc4-b0ac00f5e6bd",
            "row_num": 122
        },
        {
            "Code": "39",
            "Subject": "Отделение по Пензенской обл. Волго-Вятского ГУ Банка России",
            "Organization": "Отделение по Пензенской обл. Волго-Вятского ГУ Банка России",
            "Addressee": "56_Руководство",
            "DirSDS": "22_lk",
            "TypeIE2": "ВВГУ",
            "Prefix": "ALL",
            "Id": "cf331984-ef54-4507-bdcb-b0ac00f5e6bd",
            "row_num": 123
        },
        {
            "Code": "106",
            "Subject": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
            "Organization": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
            "Addressee": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
            "DirSDS": "40_lk",
            "TypeIE2": "СЗГУ",
            "Prefix": "ALL",
            "Id": "5c3aabaa-31ad-4818-bf4d-b0ac00f5e6bd",
            "row_num": 124
        }
    ],
    "PaginationInfo": {
        "TotalRecords": 124,
        "TotalPages": 2,
        "CurrentPage": 2,
        "PerCurrentPage": 24,
        "PerNextPage": null,
        "MaxPerPage": 100
    }
}
*/
