#region License
/*
Copyright 2022-2025 Dmitrii Evdokimov
Open source software

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
*/
#endregion

using Diev.Portal5.API.Tools;

namespace Diev.Portal5.API.Dictionaries;

/// <summary>
/// GET https://portal5.cbr.ru/back/rapi2/dictionaries/64529d5a-b1d9-453c-96f3-f380ea577314 (level 3 Addresse)<br/>
/// GET https://portal5.cbr.ru/back/rapi2/dictionaries/64529d5a-b1d9-453c-96f3-f380ea577314?page=3<br/>
/// 200 OK
/// </summary>
public record Level3ItemsPage
(   
    /// <summary>
    /// Example: "[{...}, ...]"
    /// </summary>
    IReadOnlyList<Level3Item> Items,

    /// <summary>
    /// Example: {
    /// "TotalRecords": 124,
    /// "TotalPages": 2,
    /// "CurrentPage": 1,
    /// "PerCurrentPage": 100,
    /// "PerNextPage": 24,
    /// "MaxPerPage": 100
    /// }
    /// </summary>
    Pagination Pages
);

#region Mock
//public static class MockLevel3ItemsPage
//{
//    /// <summary>
//    /// dictionaries/64529d5a-b1d9-453c-96f3-f380ea577314
//    /// </summary>
//    /// <returns></returns>
//    /// <remarks>
//    /// Headers page 1:<br/>
//    /// EPVV-Total: 123<br/>
//    /// EPVV-TotalPages: 2<br/>
//    /// EPVV-CurrentPage: 1<br/>
//    /// EPVV-PerCurrentPage: 100<br/>
//    /// EPVV-PerNextPage: 23<br/>
//    /// <br/>
//    /// Headers page 2:<br/>
//    /// EPVV-Total: 123<br/>
//    /// EPVV-TotalPages: 2<br/>
//    /// EPVV-CurrentPage: 2<br/>
//    /// EPVV-PerCurrentPage: 23
//    /// </remarks>
//    public static string Page(int page = 1) => page switch
//    {
//        1 => """
//            {
//                "Items": [
//                    {
//                        "Code": "106",
//                        "Subject": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
//                        "Addressee": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "023c71f8-8fc7-4cee-bcfd-b30200e29356"
//                    },
//                    {
//                        "Code": "110",
//                        "Subject": "Отделение-НБ по Республике Коми Северо-Западного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Коми Северо-Западного ГУ Банка России",
//                        "Addressee": "(87) Управляющий Отделением-НБ Республика Коми",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "082da795-16ad-4687-bbf4-b30200e29356"
//                    },
//                    {
//                        "Code": "22",
//                        "Subject": "Отделение по Ставропольскому краю Южного ГУ Банка России",
//                        "Organization": "Отделение по Ставропольскому краю Южного ГУ Банка России",
//                        "Addressee": "Административный отдел",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "09ccee0d-dcfc-4e48-97b0-b30200e29356"
//                    },
//                    {
//                        "Code": "28",
//                        "Subject": "Отделение по г. Севастополь Южного ГУ Банка России",
//                        "Organization": "Отделение по г. Севастополь Южного ГУ Банка России",
//                        "Addressee": "Административный отдел (Севастополь)",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "0ac3a3ee-65a3-4d82-9075-b30200e29356"
//                    },
//                    {
//                        "Code": "117",
//                        "Subject": "Центр финансового мониторинга и валютного контроля (г. Владивосток)",
//                        "Organization": "Центр финансового мониторинга и валютного контроля (г. Владивосток)",
//                        "Addressee": "Центр финансового мониторинга и валютного контроля (г. Владивосток)",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "0c53653f-d7ee-4118-85c6-b30200e29356"
//                    },
//                    {
//                        "Code": "26",
//                        "Subject": "Отделение по Республике Крым Южного ГУ Банка России",
//                        "Organization": "Отделение по Республике Крым Южного ГУ Банка России",
//                        "Addressee": "Административный отдел",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "10d4b9bc-72a1-4425-ad26-b30200e29356"
//                    },
//                    {
//                        "Code": "42",
//                        "Subject": "Отделение-НБ по Республике Марий Эл Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Марий Эл Волго-Вятского ГУ Банка России",
//                        "Addressee": "Административный отдел",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "1131fd7e-a1c4-44fc-b446-b30200e29356"
//                    },
//                    {
//                        "Code": "49",
//                        "Subject": "Отделение по Оренбургской обл. Уральского ГУ Банка России",
//                        "Organization": "Отделение по Оренбургской обл. Уральского ГУ Банка России",
//                        "Addressee": "553-Руководство Отделения Оренбург",
//                        "DirSDS": "65_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "14f75417-642f-4f81-b985-b30200e29356"
//                    },
//                    {
//                        "Code": "90",
//                        "Subject": "Отделение-НБ по Удмуртской Республике Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Удмуртской Республике Волго-Вятского ГУ Банка России",
//                        "Addressee": "94_Руководство",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "1512d14c-ad23-4767-a91b-b30200e29356"
//                    },
//                    {
//                        "Code": "21",
//                        "Subject": "Южное ГУ Банка России",
//                        "Organization": "Южное ГУ Банка России",
//                        "Addressee": "Административное управление",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "1abf7119-5aad-47f8-b340-b30200e29356"
//                    },
//                    {
//                        "Code": "02",
//                        "Subject": "Отделение по Белгородской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Белгородской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "1c86ef7c-42f4-4dd6-b0e5-b30200e29356"
//                    },
//                    {
//                        "Code": "108",
//                        "Subject": "Уральский межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Уральский межрегиональный центр инспектирования ГИ Банка России",
//                        "Addressee": "Уральский межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "65_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "1ca21799-89da-40ff-bb39-b30200e29356"
//                    },
//                    {
//                        "Code": "101",
//                        "Subject": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
//                        "Addressee": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ГИБР",
//                        "Prefix": "ALL",
//                        "Id": "1d8513e1-27ea-4027-84bf-b30200e29356"
//                    },
//                    {
//                        "Code": "92",
//                        "Subject": "Центр по обработке отчетности (Тверь)",
//                        "Organization": "Центр по обработке отчетности Тверь",
//                        "Addressee": "Центр по обработке отчетности (Тверь)",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "216a7e1f-f8f8-4eb8-9f94-b30200e29356"
//                    },
//                    {
//                        "Code": "68",
//                        "Subject": "Отделение по Амурской обл. Дальневосточного ГУ Банка России",
//                        "Organization": "Отделение по Амурской обл. Дальневосточного ГУ Банка России",
//                        "Addressee": "(710) Руководство",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "24357421-5ab9-4785-b454-b30200e29356"
//                    },
//                    {
//                        "Code": "118",
//                        "Subject": "Центр защиты прав потребителей в г. Ростов-на-Дону",
//                        "Organization": "Центр защиты прав потребителей в г. Ростов-на-Дону",
//                        "Addressee": "Центр защиты прав потребителей в г. Ростов-на-Дону",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "26e48ea9-abd2-4f81-8165-b30200e29356"
//                    },
//                    {
//                        "Code": "93",
//                        "Subject": "Главная инспекция Банка России",
//                        "Organization": "Банк России",
//                        "Addressee": "Главная инспекция Банка России",
//                        "DirSDS": "48_lk",
//                        "TypeIE2": "ГИБР",
//                        "Prefix": "ALL",
//                        "Id": "276bfe30-d805-4039-89bc-b30200e29356"
//                    },
//                    {
//                        "Code": "41",
//                        "Subject": "Отделение по Ульяновской обл. Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение по Ульяновской обл. Волго-Вятского ГУ Банка России",
//                        "Addressee": "73_АДМИНИСТРАТИВНЫЙ ОТДЕЛ",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "27f8d6db-8636-41b7-88b4-b30200e29356"
//                    },
//                    {
//                        "Code": "61",
//                        "Subject": "Отделение по Забайкальскому краю Сибирского ГУ Банка России",
//                        "Organization": "Отделение по Забайкальскому краю Сибирского ГУ Банка России",
//                        "Addressee": "76_Руководство",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "2d2de302-fef0-4a06-8c58-b30200e29356"
//                    },
//                    {
//                        "Code": "103",
//                        "Subject": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
//                        "Organization": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
//                        "Addressee": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "2e363ef9-b64d-4bb6-ac5b-b30200e29356"
//                    },
//                    {
//                        "Code": "125",
//                        "Subject": "Межрегиональный центр надзора в системе кредитной информации (г. Красноярск)",
//                        "Organization": "Межрегиональный центр надзора в системе кредитной информации (г. Красноярск)",
//                        "Addressee": "Межрегиональный центр надзора в системе кредитной информации (г. Красноярск)",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "2e599a53-1b6e-4be9-92e4-b30200e29356"
//                    },
//                    {
//                        "Code": "69",
//                        "Subject": "Отделение по Камчатскому краю Дальневосточного ГУ Банка России",
//                        "Organization": "Отделение по Камчатскому краю Дальневосточного ГУ Банка России",
//                        "Addressee": "(730) Руководство",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "2f9a7794-5e17-4249-bb16-b30200e29356"
//                    },
//                    {
//                        "Code": "88",
//                        "Subject": "Восточный центр допуска финансовых организаций",
//                        "Organization": "Банк России",
//                        "Addressee": "ВЦДФО_ДДиПДФО (предв. расм.)",
//                        "DirSDS": "48_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "2fb163cd-d225-499b-910c-b30200e29356"
//                    },
//                    {
//                        "Code": "19",
//                        "Subject": "Отделение-НБ по Республике Карелия Северо-Западного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Карелия Северо-Западного ГУ Банка России",
//                        "Addressee": "(86) Руководство",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "2fc51947-31e0-42b3-afe1-b30200e29356"
//                    },
//                    {
//                        "Code": "17",
//                        "Subject": "Отделение по Новгородской обл. Северо-Западного ГУ Банка России",
//                        "Organization": "Отделение по Новгородской обл. Северо-Западного ГУ Банка России",
//                        "Addressee": "(49) Административный отдел",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "327071ab-3c6e-445b-a5fd-b30200e29356"
//                    },
//                    {
//                        "Code": "32",
//                        "Subject": "Отделение-НБ по Республике Калмыкия Южного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Калмыкия Южного ГУ Банка России",
//                        "Addressee": "Административный отдел Отделения-НБ Республика Калмыкия",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "33bcda5e-cabd-4d5b-8792-b30200e29356"
//                    },
//                    {
//                        "Code": "017",
//                        "Subject": "Отделение по Ярославской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Ярославской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "3763d4ac-779e-4b54-afbd-b30200e29356"
//                    },
//                    {
//                        "Code": "34",
//                        "Subject": "Отделение-НБ по Карачаево-Черкесской Республике Южного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Карачаево-Черкесской Республике Южного ГУ Банка России",
//                        "Addressee": "Административный отдел Отделения-НБ Карачаево-Черкесская Республика",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "3d86ad25-c5db-44f4-bd5d-b30200e29356"
//                    },
//                    {
//                        "Code": "29",
//                        "Subject": "Отделение-НБ по Республике Адыгея Южного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Адыгея Южного ГУ Банка России",
//                        "Addressee": "Административный отдел",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "3d96adc9-30f9-473b-8162-b30200e29356"
//                    },
//                    {
//                        "Code": "60",
//                        "Subject": "Отделение по Томской обл. Сибирского ГУ Банка России",
//                        "Organization": "Отделение по Томской обл. Сибирского ГУ Банка России",
//                        "Addressee": "69_Административный отдел",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "3e1bc8de-f920-4c41-a9c4-b30200e29356"
//                    },
//                    {
//                        "Code": "64",
//                        "Subject": "Отделение-НБ по Республике Тыва Сибирского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Тыва Сибирского ГУ Банка России",
//                        "Addressee": "93_Управляющий",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "3fcd217b-ae5d-410b-b831-b30200e29356"
//                    },
//                    {
//                        "Code": "123",
//                        "Subject": "Региональный центр развития Казань",
//                        "Organization": "Региональный центр развития Казань",
//                        "Addressee": "Региональный центр развития Казань",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "414ad30e-5299-4b1a-8b89-b30200e29356"
//                    },
//                    {
//                        "Code": "59",
//                        "Subject": "Отделение по Омской обл. Сибирского ГУ Банка России",
//                        "Organization": "Отделение по Омской обл. Сибирского ГУ Банка России",
//                        "Addressee": "52_Руководство",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "45e71f28-3522-411f-8175-b30200e29356"
//                    },
//                    {
//                        "Code": "011",
//                        "Subject": "Отделение по Липецкой обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Липецкой обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "46b21086-ad1e-4b04-822d-b30200e29356"
//                    },
//                    {
//                        "Code": "07",
//                        "Subject": "Отделение по Тверской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Тверской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "47d05ace-df8e-4235-879d-b30200e29356"
//                    },
//                    {
//                        "Code": "13",
//                        "Subject": "Отделение по Вологодской обл. Северо-Западного ГУ Банка России",
//                        "Organization": "Отделение по Вологодской обл. Северо-Западного ГУ Банка России",
//                        "Addressee": "(19) Руководство Отделения Вологда",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "485c50d5-5290-4ab1-87ef-b30200e29356"
//                    },
//                    {
//                        "Code": "131",
//                        "Subject": "Центр по надзору за микрофинансовыми институтами № 1 (г. Нижний Новгород)",
//                        "Organization": "Центр по надзору за микрофинансовыми институтами № 1 (г. Нижний Новгород)",
//                        "Addressee": "Центр по надзору за микрофинансовыми институтами № 1 (г. Нижний Новгород)",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "488ce4b1-2b14-4d6b-a158-b30200e29356"
//                    },
//                    {
//                        "Code": "97",
//                        "Subject": "Межрегиональный центр инспектирования Центрального федерального округа",
//                        "Organization": "Банк России",
//                        "Addressee": "Межрегиональный центр инспектирования Центрального федерального округа",
//                        "DirSDS": "48_lk",
//                        "TypeIE2": "ГИБР",
//                        "Prefix": "ALL",
//                        "Id": "49b52940-2968-4143-ac31-b30200e29356"
//                    },
//                    {
//                        "Code": "130",
//                        "Subject": "Аналитический центр по финансовым посредникам (г. Новосибирск)",
//                        "Organization": "Аналитический центр по финансовым посредникам (г. Новосибирск)",
//                        "Addressee": "Аналитический центр по финансовым посредникам (г. Новосибирск)",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "4d6049d3-6d62-46d4-9494-b30200e29356"
//                    },
//                    {
//                        "Code": "80",
//                        "Subject": "Управление поддержки потребителей «С» Единого коммуникационного центра СЗППиОДФУ",
//                        "Organization": "Управление поддержки потребителей «С» Единого коммуникационного центра СЗППиОДФУ",
//                        "Addressee": "Управление поддержки потребителей «С» Единого коммуникационного центра СЗППиОДФУ",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "СЗППОДФУ",
//                        "Prefix": "ALL",
//                        "Id": "4e5b1f0e-59ca-408f-9595-b30200e29356"
//                    },
//                    {
//                        "Code": "010",
//                        "Subject": "Отделение по Курской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Курской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "4e9bca9d-576a-4cab-89fe-b30200e29356"
//                    },
//                    {
//                        "Code": "53",
//                        "Subject": "Отделение-НБ по Республике Башкортостан Уральского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Башкортостан Уральского ГУ Банка России",
//                        "Addressee": "Руководство",
//                        "DirSDS": "80_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "4ea09378-9d67-4589-bb1f-b30200e29356"
//                    },
//                    {
//                        "Code": "99",
//                        "Subject": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
//                        "Addressee": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ГИБР",
//                        "Prefix": "ALL",
//                        "Id": "4f6f4f6d-63b5-4fab-af39-b30200e29356"
//                    },
//                    {
//                        "Code": "129",
//                        "Subject": "Центр надзора за финансовыми посредниками №1 (г. Санкт-Петербург)",
//                        "Organization": "Центр надзора за финансовыми посредниками №1 (г. Санкт-Петербург)",
//                        "Addressee": "Центр надзора за финансовыми посредниками №1 (г. Санкт-Петербург)",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "4f920725-7272-4b45-9694-b30200e29356"
//                    },
//                    {
//                        "Code": "78",
//                        "Subject": "Служба по защите прав потребителей и обеспечению доступности финансовых услуг (Центральный аппарат)",
//                        "Organization": "Банк России",
//                        "Addressee": "Служба по защите прав потребителей и обеспечению доступности финансовых услуг",
//                        "DirSDS": "48_lk",
//                        "TypeIE2": "СЗППОДФУ",
//                        "Prefix": "ALL",
//                        "Id": "519dff4f-b66d-4b36-8623-b30200e29356"
//                    },
//                    {
//                        "Code": "40",
//                        "Subject": "Отделение по Саратовской обл. Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение по Саратовской обл. Волго-Вятского ГУ Банка России",
//                        "Addressee": "Отделение Саратов",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "5738d61d-19ad-4749-85ea-b30200e29356"
//                    },
//                    {
//                        "Code": "06",
//                        "Subject": "Отделение по Ивановской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Ивановской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "580e756d-0bda-4e91-b5e6-b30200e29356"
//                    },
//                    {
//                        "Code": "12",
//                        "Subject": "Отделение по Архангельской обл. Северо-Западного ГУ Банка России",
//                        "Organization": "Отделение по Архангельской обл. Северо-Западного ГУ Банка России",
//                        "Addressee": "(11) Руководство Отделения",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "5bf4027a-1c79-4ddb-a6c1-b30200e29356"
//                    },
//                    {
//                        "Code": "122",
//                        "Subject": "Центр финансового мониторинга и валютного контроля (г. Екатеринбург)",
//                        "Organization": "Центр финансового мониторинга и валютного контроля (г. Екатеринбург)",
//                        "Addressee": "Центр финансового мониторинга и валютного контроля (г. Екатеринбург)",
//                        "DirSDS": " 65_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "5d50be74-00a6-475d-9bdd-b30200e29356"
//                    },
//                    {
//                        "Code": "24",
//                        "Subject": "Отделение по Волгоградской обл. Южного ГУ Банка России",
//                        "Organization": "Отделение по Волгоградской обл. Южного ГУ Банка России",
//                        "Addressee": "Секретариат управляющего отделением",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "5f7ab284-138d-4020-9428-b30200e29356"
//                    },
//                    {
//                        "Code": "115",
//                        "Subject": "Центр защиты прав потребителей в г. Нижний Новгород",
//                        "Organization": "Центр защиты прав потребителей в г. Нижний Новгород",
//                        "Addressee": "Центр защиты прав потребителей в г. Нижний Новгород",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "62406e91-89b1-4726-9b87-b30200e29356"
//                    },
//                    {
//                        "Code": "76",
//                        "Subject": "Западный центр допуска финансовых организаций",
//                        "Organization": "Банк России",
//                        "Addressee": "ЗЦДФО_ДДиПДФО (предв.расм.)",
//                        "DirSDS": "48_lk",
//                        "TypeIE2": "ДДПДФО",
//                        "Prefix": "ALL",
//                        "Id": "649b3e05-7f78-40b9-af73-b30200e29356"
//                    },
//                    {
//                        "Code": "77",
//                        "Subject": "Восточный центр допуска финансовых организаций",
//                        "Organization": "Банк России",
//                        "Addressee": "ВЦДФО_ДДиПДФО (предв. расм.)",
//                        "DirSDS": "48_lk",
//                        "TypeIE2": "ДДПДФО",
//                        "Prefix": "ALL",
//                        "Id": "683c3588-3384-4dfc-9a6c-b30200e29356"
//                    },
//                    {
//                        "Code": "31",
//                        "Subject": "Отделение-НБ по Кабардино-Балкарской Республике Южного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Кабардино-Балкарской Республике Южного ГУ Банка России",
//                        "Addressee": "383-1_ Управляющий",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "6bcec9b9-f2a3-459f-b955-b30200e29356"
//                    },
//                    {
//                        "Code": "016",
//                        "Subject": "Отделение по Тульской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Тульской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "6c16fa9b-624a-49cf-9d8c-b30200e29356"
//                    },
//                    {
//                        "Code": "94",
//                        "Subject": "Южный и Северо-Кавказский межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Отделение по Ростовской обл. Южного ГУ Банка России",
//                        "Addressee": "Южный и Северо-Кавказский межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ГИБР",
//                        "Prefix": "ALL",
//                        "Id": "6dd087ee-ea30-4bf3-b15e-b30200e29356"
//                    },
//                    {
//                        "Code": "114",
//                        "Subject": "Управление СТБН в г. Нижний Новгород ",
//                        "Organization": "Волго-Вятское ГУ Банка России",
//                        "Addressee": "СТБН Отдел банковского надзора №4 УБН №4",
//                        "DirSDS": "48_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "6ded15a7-7356-4a2c-9f48-b30200e29356"
//                    },
//                    {
//                        "Code": "75",
//                        "Subject": "Департамент допуска и прекращения деятельности финансовых организаций",
//                        "Organization": "Банк России",
//                        "Addressee": "Департамент допуска и прекращения деятельности финансовых организаций",
//                        "DirSDS": "48_lk",
//                        "TypeIE2": "ДДПДФО",
//                        "Prefix": "ALL",
//                        "Id": "70153790-8ce0-401c-9edf-b30200e29356"
//                    },
//                    {
//                        "Code": "65",
//                        "Subject": "Отделение-НБ по Республике Хакасия Сибирского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Хакасия Сибирского ГУ Банка России",
//                        "Addressee": "95_Руководство",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "725fb253-ec77-4672-bf6b-b30200e29356"
//                    },
//                    {
//                        "Code": "132",
//                        "Subject": "Центр допуска и контроля финансовых инструментов (г. Орел)",
//                        "Organization": "Центр допуска и контроля финансовых инструментов (г. Орел)",
//                        "Addressee": "Центр допуска и контроля финансовых инструментов (г. Орел)",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "7282cdf0-3286-4c3d-afee-b30200e29356"
//                    },
//                    {
//                        "Code": "11",
//                        "Subject": "Северо-Западное ГУ Банка России",
//                        "Organization": "Северо-Западное ГУ Банка России",
//                        "Addressee": "Административное управление",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "73a7f5b4-a34b-4c00-ae8f-b30200e29356"
//                    },
//                    {
//                        "Code": "09",
//                        "Subject": "Отделение по Костромской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Костромской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "73bdf89b-62df-4bbe-8d57-b30200e29356"
//                    },
//                    {
//                        "Code": "18",
//                        "Subject": "Отделение по Псковской обл. Северо-Западного ГУ Банка России",
//                        "Organization": "Отделение по Псковской обл. Северо-Западного ГУ Банка России",
//                        "Addressee": "(58) руководство Отделения Псков",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "74bddf90-f62d-46f2-9500-b30200e29356"
//                    },
//                    {
//                        "Code": "01",
//                        "Subject": "ГУ Банка России по Центральному федеральному округу (Московский регион)",
//                        "Organization": "ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство ГУ",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "767e7b42-425e-41de-b5f1-b30200e29356"
//                    },
//                    {
//                        "Code": "30",
//                        "Subject": "Отделение - Национальный банк по Республике Дагестан Южного главного управления Центрального банка Российской Федерации",
//                        "Organization": "Отделение - Национальный банк по Республике Дагестан Южного главного управления Центрального банка Российской Федерации",
//                        "Addressee": "Административный отдел",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "79ba6f72-67ff-4b1b-880c-b30200e29356"
//                    },
//                    {
//                        "Code": "39",
//                        "Subject": "Отделение по Пензенской обл. Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение по Пензенской обл. Волго-Вятского ГУ Банка России",
//                        "Addressee": "56_Руководство",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "7a1b5049-1613-4d97-bbe5-b30200e29356"
//                    },
//                    {
//                        "Code": "89",
//                        "Subject": "Западный центр допуска финансовых организаций",
//                        "Organization": "Западный центр допуска финансовых организаций",
//                        "Addressee": "Западный центр допуска финансовых организаций",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "7bc97822-a99c-469f-997f-b30200e29356"
//                    },
//                    {
//                        "Code": "52",
//                        "Subject": "Отделение по Челябинской обл. Уральского ГУ Банка России",
//                        "Organization": "Отделение по Челябинской обл. Уральского ГУ Банка России",
//                        "Addressee": "Руководство",
//                        "DirSDS": "75_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "7f318d75-b5e5-4b38-b925-b30200e29356"
//                    },
//                    {
//                        "Code": "124",
//                        "Subject": "Межрегиональный центр надзора в системе кредитной информации (г. Самара)",
//                        "Organization": "Межрегиональный центр надзора в системе кредитной информации (г. Самара)",
//                        "Addressee": "Межрегиональный центр надзора в системе кредитной информации (г. Самара)",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "83cbc012-a50e-43ec-9cf2-b30200e29356"
//                    },
//                    {
//                        "Code": "014",
//                        "Subject": "Отделение по Смоленской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Смоленской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "841b958e-cb81-444e-88dc-b30200e29356"
//                    },
//                    {
//                        "Code": "37",
//                        "Subject": "Отделение по Кировской обл. Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение по Кировской обл. Волго-Вятского ГУ Банка России",
//                        "Addressee": "33_РУКОВОДСТВО",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "888032fe-7ccd-4995-ab37-b30200e29356"
//                    },
//                    {
//                        "Code": "36",
//                        "Subject": "Волго-Вятское ГУ Банка России",
//                        "Organization": "Волго-Вятское ГУ Банка России",
//                        "Addressee": "Административное управление",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "8c62ba1e-3717-437c-9e4b-b30200e29356"
//                    },
//                    {
//                        "Code": "139",
//                        "Subject": "Центр защиты прав потребителей в г. Ростов-на-Дону",
//                        "Organization": "Центр защиты прав потребителей в г. Ростов-на-Дону",
//                        "Addressee": "Центр защиты прав потребителей в г. Ростов-на-Дону",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "СЗППОДФУ",
//                        "Prefix": "ALL",
//                        "Id": "902b58b4-02a7-4777-8539-b30200e29356"
//                    },
//                    {
//                        "Code": "48",
//                        "Subject": "Отделение по Курганской обл. Уральского ГУ Банка России",
//                        "Organization": "Отделение по Курганской обл. Уральского ГУ Банка России",
//                        "Addressee": "537_Руководство",
//                        "DirSDS": "65_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "93e028c9-a7c0-43af-81f8-b30200e29356"
//                    },
//                    {
//                        "Code": "71",
//                        "Subject": "Отделение по Сахалинской обл. Дальневосточного ГУ Банка России",
//                        "Organization": "Отделение по Сахалинской обл. Дальневосточного ГУ Банка России",
//                        "Addressee": "(764)Руководство",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "95a7b651-1523-4dba-8699-b30200e29356"
//                    },
//                    {
//                        "Code": "43",
//                        "Subject": "Отделение-НБ по Республике Мордовия Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Мордовия Волго-Вятского ГУ Банка России",
//                        "Addressee": "89_Заместитель управляющего",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "95a810c6-986e-4b31-8003-b30200e29356"
//                    },
//                    {
//                        "Code": "95",
//                        "Subject": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
//                        "Organization": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
//                        "Addressee": "Центр инспектирования г. Новосибирск Уральского МЦИ ГИ Банка России",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "ГИБР",
//                        "Prefix": "ALL",
//                        "Id": "9a1fabe9-de30-4d1a-bb44-b30200e29356"
//                    },
//                    {
//                        "Code": "67",
//                        "Subject": "Отделение по Хабаровскому краю Дальневосточного ГУ Банка России",
//                        "Organization": "Отделение по Хабаровскому краю Дальневосточного ГУ Банка России",
//                        "Addressee": "(708) Руководство",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "9c8b654e-4d76-4fcb-9bd1-b30200e29356"
//                    },
//                    {
//                        "Code": "38",
//                        "Subject": "Отделение по Самарской обл. Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение по Самарской обл. Волго-Вятского ГУ Банка России",
//                        "Addressee": "Руководство Отделения Самара",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "a32b9279-59c8-4fe2-9720-b30200e29356"
//                    },
//                    {
//                        "Code": "81",
//                        "Subject": "Управление поддержки потребителей «В» Единого коммуникационного центра СЗППиОДФУ",
//                        "Organization": "Управление поддержки потребителей «В» Единого коммуникационного центра СЗППиОДФУ",
//                        "Addressee": "Управление поддержки потребителей «В» Единого коммуникационного центра СЗППиОДФУ",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "СЗППОДФУ",
//                        "Prefix": "ALL",
//                        "Id": "a5add13f-aa58-49e5-b98c-b30200e29356"
//                    },
//                    {
//                        "Code": "109",
//                        "Subject": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
//                        "Addressee": "Дальневосточный межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "a608b229-f124-4d95-965a-b30200e29356"
//                    },
//                    {
//                        "Code": "27",
//                        "Subject": "Отделение по Ростовской обл. Южного ГУ Банка России",
//                        "Organization": "Отделение по Ростовской обл. Южного ГУ Банка России",
//                        "Addressee": "Административный отдел",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "aa424e4f-b1dd-433c-8542-b30200e29356"
//                    },
//                    {
//                        "Code": "96",
//                        "Subject": "Межрегиональный центр инспектирования крупнейших участников финансового рынка",
//                        "Organization": "Банк России",
//                        "Addressee": "Межрегиональный центр инспектирования крупнейших участников финансового рынка",
//                        "DirSDS": "48_lk",
//                        "TypeIE2": "ГИБР",
//                        "Prefix": "ALL",
//                        "Id": "ade2a615-29de-4f5b-a538-b30200e29356"
//                    },
//                    {
//                        "Code": "100",
//                        "Subject": "Уральский межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Уральский межрегиональный центр инспектирования ГИ Банка России",
//                        "Addressee": "Уральский межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "65_lk",
//                        "TypeIE2": "ГИБР",
//                        "Prefix": "ALL",
//                        "Id": "b1abbf30-c423-4fa6-9436-b30200e29356"
//                    },
//                    {
//                        "Code": "54",
//                        "Subject": "Сибирское ГУ Банка России",
//                        "Organization": "Сибирское ГУ Банка России",
//                        "Addressee": "Руководство Сибирского ГУ",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "b292c5f1-6fab-40f0-9310-b30200e29356"
//                    },
//                    {
//                        "Code": "98",
//                        "Subject": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
//                        "Addressee": "Северо-Западный межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "ГИБР",
//                        "Prefix": "ALL",
//                        "Id": "b3608b91-b26d-4e14-b9b6-b30200e29356"
//                    },
//                    {
//                        "Code": "57",
//                        "Subject": "Отделение по Иркутской обл. Сибирского ГУ Банка России",
//                        "Organization": "Отделение по Иркутской обл. Сибирского ГУ Банка России",
//                        "Addressee": "25_Руководство",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "b390ea31-059d-4b11-98a8-b30200e29356"
//                    },
//                    {
//                        "Code": "137",
//                        "Subject": "Центр защиты прав потребителей в г. Нижний Новгород",
//                        "Organization": "Центр защиты прав потребителей в г. Нижний Новгород",
//                        "Addressee": "Центр защиты прав потребителей в г. Нижний Новгород",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "СЗППОДФУ",
//                        "Prefix": "ALL",
//                        "Id": "b59088d6-3883-4da3-b01e-b30200e29356"
//                    },
//                    {
//                        "Code": "62",
//                        "Subject": "Отделение-НБ по Республике Бурятия Сибирского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Бурятия Сибирского ГУ Банка России",
//                        "Addressee": "81_Руководство",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "b5967385-c499-404e-8192-b30200e29356"
//                    },
//                    {
//                        "Code": "55",
//                        "Subject": "Отделение по Алтайскому краю Сибирского ГУ Банка России",
//                        "Organization": "Отделение по Алтайскому краю Сибирского ГУ Банка России",
//                        "Addressee": "01_Руководство",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "b8267269-7722-48ad-839f-b30200e29356"
//                    },
//                    {
//                        "Code": "47",
//                        "Subject": "Уральское ГУ Банка России",
//                        "Organization": "Уральское ГУ Банка России",
//                        "Addressee": "Руководство Уральского ГУ Банка России",
//                        "DirSDS": "65_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "b92421ef-d242-460a-993c-b30200e29356"
//                    },
//                    {
//                        "Code": "015",
//                        "Subject": "Отделение по Тамбовской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Тамбовской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "b98c2d2b-4d12-4bcb-9b1c-b30200e29356"
//                    },
//                    {
//                        "Code": "73",
//                        "Subject": "Отделение-НБ по Республике Саха (Якутия) Дальневосточного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Саха (Якутия) Дальневосточного ГУ Банка России",
//                        "Addressee": "798 Руководство О-НБ",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "bb76a3aa-a9ec-4579-b641-b30200e29356"
//                    },
//                    {
//                        "Code": "14",
//                        "Subject": "Отделение по Калининградской обл. Северо-Западного ГУ Банка России",
//                        "Organization": "Отделение по Калининградской обл. Северо-Западного ГУ Банка России",
//                        "Addressee": "(227)Руководство (Отделения)",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "bded14ae-722d-4d37-afb8-b30200e29356"
//                    },
//                    {
//                        "Code": "141",
//                        "Subject": "Центр операционной поддержки операций с цифровыми рублями «Самара»",
//                        "Organization": "Волго-Вятское ГУ Банка России",
//                        "Addressee": "Центр операционной поддержки с ЦР «Самара»",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "c0fc8774-0f0e-4689-8a64-b30200e29356"
//                    },
//                    {
//                        "Code": "05",
//                        "Subject": "Отделение по Воронежской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Воронежской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "c22ceedd-013e-4370-a7b2-b30200e29356"
//                    },
//                    {
//                        "Code": "35",
//                        "Subject": "Отделение-НБ по Чеченской Республике Южного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Чеченской Республике Южного ГУ Банка России",
//                        "Addressee": "Административный отдел",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "c5f5d7fd-592a-4ec8-9086-b30200e29356"
//                    },
//                    {
//                        "Code": "70",
//                        "Subject": "Отделение по Магаданской обл. Дальневосточного ГУ Банка России",
//                        "Organization": "Отделение по Магаданской обл. Дальневосточного ГУ Банка России",
//                        "Addressee": "744Руководство Отделение Магадан",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "c82bcfb6-4456-4ba8-bd21-b30200e29356"
//                    },
//                    {
//                        "Code": "16",
//                        "Subject": "Отделение по Мурманской обл. Северо-Западного ГУ Банка России",
//                        "Organization": "Отделение по Мурманской обл. Северо-Западного ГУ Банка России",
//                        "Addressee": "(47) Климов А.Г. - Управляющий Отделением",
//                        "DirSDS": "40_lk",
//                        "TypeIE2": "СЗГУ",
//                        "Prefix": "ALL",
//                        "Id": "cd9c1d32-5542-4c44-88af-b30200e29356"
//                    },
//                    {
//                        "Code": "140",
//                        "Subject": "Центр допуска и контроля финансовых инструментов (г. Орел)",
//                        "Organization": "Центр допуска и контроля финансовых инструментов (г. Орел)",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "cec87a83-e75a-4ffe-909c-b30200e29356"
//                    }
//                ],
//                "PaginationInfo": {
//                    "TotalRecords": 123,
//                    "TotalPages": 2,
//                    "CurrentPage": 1,
//                    "PerCurrentPage": 100,
//                    "PerNextPage": 23,
//                    "MaxPerPage": 100
//                }
//            }
//            """,

//        2 => """
//            {
//                "Items": [
//                    {
//                        "Code": "013",
//                        "Subject": "Отделение по Рязанской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Рязанской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "d033e3e2-3151-47c4-b9a0-b30200e29356"
//                    },
//                    {
//                        "Code": "126",
//                        "Subject": "Центр по надзору за микрофинансовыми институтами № 2 (г. Екатеринбург)",
//                        "Organization": "Центр по надзору за микрофинансовыми институтами № 2 (г. Екатеринбург)",
//                        "Addressee": "Центр по надзору за микрофинансовыми институтами № 2 (г. Екатеринбург)",
//                        "DirSDS": "65_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "d25824aa-8a55-4e9b-9a33-b30200e29356"
//                    },
//                    {
//                        "Code": "51",
//                        "Subject": "Отделение по Тюменской обл. Уральского ГУ Банка России",
//                        "Organization": "Отделение по Тюменской обл. Уральского ГУ Банка России",
//                        "Addressee": "Руководство Отделения Тюмень",
//                        "DirSDS": "65_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "d4a3c521-3b94-470b-8946-b30200e29356"
//                    },
//                    {
//                        "Code": "56",
//                        "Subject": "Отделение по Красноярскому краю Сибирского ГУ Банка России",
//                        "Organization": "Отделение по Красноярскому краю Сибирского ГУ Банка России",
//                        "Addressee": "04_Руководство Отделения",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "d52f679d-8537-40ab-9faa-b30200e29356"
//                    },
//                    {
//                        "Code": "23",
//                        "Subject": "Отделение по Астраханской обл. Южного ГУ Банка России",
//                        "Organization": "Отделение по Астраханской обл. Южного ГУ Банка России",
//                        "Addressee": "Руководство",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "dd7cd79f-783d-4d8e-8259-b30200e29356"
//                    },
//                    {
//                        "Code": "04",
//                        "Subject": "Отделение по Владимирской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Владимирской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "de542cea-c176-4cc2-8d1d-b30200e29356"
//                    },
//                    {
//                        "Code": "107",
//                        "Subject": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
//                        "Addressee": "Волго-Вятский межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "e00aea97-4a24-4006-ae08-b30200e29356"
//                    },
//                    {
//                        "Code": "138",
//                        "Subject": "Центр защиты прав потребителей в г. Екатеринбург",
//                        "Organization": "Центр защиты прав потребителей в г. Екатеринбург",
//                        "Addressee": "Центр защиты прав потребителей в г. Екатеринбург",
//                        "DirSDS": "65_lk",
//                        "TypeIE2": "СЗППОДФУ",
//                        "Prefix": "ALL",
//                        "Id": "e0ad7f0a-8ef6-49d9-a82a-b30200e29356"
//                    },
//                    {
//                        "Code": "72",
//                        "Subject": "Отделение по Чукотскому автономному округу Дальневосточного ГУ Банка России",
//                        "Organization": "Отделение по Чукотскому автономному округу Дальневосточного ГУ Банка России",
//                        "Addressee": "(777)Руководство",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "e81714bc-fbc0-4ee4-bc5e-b30200e29356"
//                    },
//                    {
//                        "Code": "46",
//                        "Subject": "Отделение-НБ по Чувашской Республике Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Чувашской Республике Волго-Вятского ГУ Банка России",
//                        "Addressee": "97_Управляющий Отделением-НБ Чувашская Республика",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "e8228edc-8f0e-4313-9d4c-b30200e29356"
//                    },
//                    {
//                        "Code": "012",
//                        "Subject": "Отделение по Орловской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Орловской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "eb24dae6-b7d8-4ad9-8f86-b30200e29356"
//                    },
//                    {
//                        "Code": "25",
//                        "Subject": "Отделение-НБ по Республике Ингушетия Южного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Ингушетия Южного ГУ Банка России",
//                        "Addressee": "Административный отдел",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "ebb156c6-c70a-4e2f-81b0-b30200e29356"
//                    },
//                    {
//                        "Code": "08",
//                        "Subject": "Отделение по Калужской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Калужской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "ebd14eab-ae69-4381-a101-b30200e29356"
//                    },
//                    {
//                        "Code": "45",
//                        "Subject": "Отделение-НБ по Республике Татарстан Волго-Вятского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Татарстан Волго-Вятского ГУ Банка России",
//                        "Addressee": "Руководство",
//                        "DirSDS": "22_lk",
//                        "TypeIE2": "ВВГУ",
//                        "Prefix": "ALL",
//                        "Id": "ede4a8fc-340d-4818-ae79-b30200e29356"
//                    },
//                    {
//                        "Code": "116",
//                        "Subject": "Центр защиты прав потребителей в г. Екатеринбург",
//                        "Organization": "Центр защиты прав потребителей в г. Екатеринбург",
//                        "Addressee": "Центр защиты прав потребителей в г. Екатеринбург",
//                        "DirSDS": "65_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "ee37f811-dd59-4369-a75f-b30200e29356"
//                    },
//                    {
//                        "Code": "58",
//                        "Subject": "Отделение по Кемеровской обл. Сибирского ГУ Банка России",
//                        "Organization": "Отделение по Кемеровской обл. Сибирского ГУ Банка России",
//                        "Addressee": "32_Управляющий Отделением Кемерово",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "f0643914-292d-42fd-bdf8-b30200e29356"
//                    },
//                    {
//                        "Code": "102",
//                        "Subject": "Южный и Северо-Кавказский межрегиональный центр инспектирования ГИ Банка России",
//                        "Organization": "Отделение по Ростовской обл. Южного ГУ Банка России",
//                        "Addressee": "Южный и Северо-Кавказский межрегиональный центр инспектирования ГИ Банка России",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "f0812103-a321-44bb-b1d9-b30200e29356"
//                    },
//                    {
//                        "Code": "33",
//                        "Subject": "Отделение-НБ по Республике Северная Осетия-Алания Южного ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Северная Осетия-Алания Южного ГУ Банка России",
//                        "Addressee": "Административный отдел Отделение-НБ Республика Северная Осетия-Алания",
//                        "DirSDS": "03_lk",
//                        "TypeIE2": "ЮГУ",
//                        "Prefix": "ALL",
//                        "Id": "f1e08c19-51cf-4716-8b2a-b30200e29356"
//                    },
//                    {
//                        "Code": "63",
//                        "Subject": "Отделение-НБ по Республике Алтай Сибирского ГУ Банка России",
//                        "Organization": "Отделение-НБ по Республике Алтай Сибирского ГУ Банка России",
//                        "Addressee": "84_Руководство",
//                        "DirSDS": "50_lk",
//                        "TypeIE2": "СГУ",
//                        "Prefix": "ALL",
//                        "Id": "f2150298-4370-4ea9-9109-b30200e29356"
//                    },
//                    {
//                        "Code": "66",
//                        "Subject": "Дальневосточное ГУ Банка России",
//                        "Organization": "Дальневосточное ГУ Банка России",
//                        "Addressee": "(ДГУ)Руководство Дальневосточного ГУ",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "f7d65db4-9efd-4bb3-910a-b30200e29356"
//                    },
//                    {
//                        "Code": "74",
//                        "Subject": "Отделение по Еврейской автономной обл. Дальневосточного ГУ Банка России",
//                        "Organization": "Отделение по Еврейской автономной обл. Дальневосточного ГУ Банка России",
//                        "Addressee": "(799) Руководство",
//                        "DirSDS": "05_lk",
//                        "TypeIE2": "ДГУ",
//                        "Prefix": "ALL",
//                        "Id": "f95785d2-93c8-4556-9cf1-b30200e29356"
//                    },
//                    {
//                        "Code": "03",
//                        "Subject": "Отделение по Брянской обл. ГУ Банка России по ЦФО",
//                        "Organization": "Отделение по Брянской обл. ГУ Банка России по ЦФО",
//                        "Addressee": "Руководство",
//                        "DirSDS": "45_lk",
//                        "TypeIE2": "ЦФО",
//                        "Prefix": "ALL",
//                        "Id": "fccec2c8-e21a-4b5f-94d0-b30200e29356"
//                    },
//                    {
//                        "Code": "50",
//                        "Subject": "Отделение по Пермскому краю Уральского ГУ Банка России",
//                        "Organization": "Отделение по Пермскому краю Уральского ГУ Банка России",
//                        "Addressee": "Административный отдел",
//                        "DirSDS": "57_lk",
//                        "TypeIE2": "УГУ",
//                        "Prefix": "ALL",
//                        "Id": "fd3f3b58-071b-42c6-8217-b30200e29356"
//                    }
//                ],
//                "PaginationInfo": {
//                    "TotalRecords": 123,
//                    "TotalPages": 2,
//                    "CurrentPage": 2,
//                    "PerCurrentPage": 23,
//                    "PerNextPage": null,
//                    "MaxPerPage": 100
//                }
//            }
//            """,

//        _ => $$"""
//            {
//                "HTTPStatus": 400,
//                "ErrorCode": "INCORRECT_PAGE_NUM",
//                "ErrorMessage": "Произошла ошибка. Некорректное значение страницы: {{page}}",
//                "MoreInfo": {
//                    "TotalItems": 123,
//                    "TotalPages": 2
//                }
//            }
//            """,
//    };
//}
#endregion
